{
  "nav": {
    "about": "About Me",
    "projects": "Projects",
    "skills": "Skills",
    "social": "Contact Me"
  },
  "home": {
    "landing": {
      "subtitle": "Always up for a challenge!"
    },
    "about": {
      "title": "About Me",
      "paragraph1": "I'm a almost graduated student whom is interested in IT and everything to do with programming. That's why I chose to study Information and Communication Technologies at Thomas More (Belgium) & JAMK (Finland). Just writing a program form scratch based on the needs of a friend, parent or client, is the thing I like the most.",
      "paragraph2": "With a second bachelor, I hope to improve my communication, team-skills and general knowledge. Of course programming is not the only thing I do. Judo will be always close to my heart, but jumping into a swimming pool is also not bad!",
      "paragraph3": "My personality is having fun and make new friends and finish what I've started. I try to be engaged in all extra events in and out of school, ex. donating blood or tutoring or join the student union's board."
    },
    "projects": {
      "name": "My Projects",
      "result": "Visit project",
      "result2": "or visit here",
      "progress": "Currently in development"
    },
    "skills": {
      "skillTitle": "Skills",
      "languageTitle": "Languages",
      "languages": {
        "dutch": "Dutch (Mother tongue)",
        "english": "English (Good)",
        "french": "French (Basic)",
        "finnish": "Finnish (Learning)"
      },
      "cv": {
        "english": "English",
        "dutch": "Dutch"
      }
    },
    "footer": {
      "nameLabel": "Enter your name",
      "emailLabel": "Enter your email",
      "messageLabel": "Enter your message",
      "namePlaceholder": "Name",
      "emailPlaceholder": "Email",
      "messagePlaceholder": "Message",
      "nameErrorReq": "Please fill in a name.",
      "emailErrorReq": "Please fill in an email.",
      "emailErrorPattern": "This is not a valid email.",
      "emailErrorEmail": "This is not a valid email.",
      "msgErrorReq": "Please write an message.",
      "sendButton": "Send",
      "sendEmail": "Email send!",
      "sendErrorEmail": "Could not send email!"
    }
  },
  "projects": {
    "geo": {
      "completed": true,
      "img": "geo",
      "name": "Geolocation",
      "paragraph1": "This project was made in my free time. My father collaborates with the archive of Geel (Belgium), and he wanted a way to show where a plot used to be located. For now this project is still a startup, because there are 6 other maps left to reference.",
      "paragraph2": "Working at this project I have learned how to reference an old map with a more up‐to‐date map or vice versa. This project was made in QGIS which has a lot to offer. With this programme you can reference, draw shape layers, select data, and a possibility to export it.",
      "link":"assets/Map_data/index.html"
    },
    "lm": {
      "completed": true,
      "img": "lm",
      "name": "LM-Sounds",
      "paragraph1": "LM-Sounds is a website made for a friend. We started talking about websites and how he always needed one. Because I want to help and with my background in IT I was interested in creating one, so I started making a MoSCoW to prioritize what was needed.",
      "paragraph2": "I really enjoyed this project, not only to create a website but also to help a friend and support him in the long run. We also keep the website up to date and try to make sure the hosting is always online.",
      "link": "https://lm-sounds.be/"
    },
    "br": {
      "completed": true,
      "img": "br",
      "name": "Beverage Rater",
      "paragraph1": "During this project I learned working with figma and prioritizing the important parts of an application. Using figma for this made it easier to select a color-palette and made it easier to turn your idea into a application.",
      "paragraph2": "Thanks to this project I really learned how to sketch an idea and make it user-friendly, so it can be easily accessible for a visitor. Also, it was important to follow your time schedule.",
      "link": "https://beverage-rat.firebaseapp.com/"
    },
    "f1": {
      "completed": true,
      "img": "f1",
      "name": "F1-Stats",
      "paragraph1": "The project started with an API I found on the internet, but it took way too long until it was updated. So the next logical step for me was to create my own. I first started drawing my database, so I know what I needed to store. The next step was creating my back-end and later the front-end.",
      "paragraph2": "During this project I've learned a lot of new ways to code, or technologies to use, which I discovered in my internship. The next thing I have tried to understand was hosting. For the first time I hosted my application on Amazon Web Services, it took a while until I figured things out.",
      "link": "https://github.com/Michiel-VE/F1",
      "link2": "https://github.com/Michiel-VE/F1_API"
    }
  },
  "donate": {
    "title": "Why not donate?",
    "link": "https://www.bloodservice.fi/blood-donation"
  }
}
