{
  "nav": {
    "about": "Over Mij",
    "projects": "Projecten",
    "skills": "Vaardigheden",
    "social": "Contacteer Mij"
  },
  "home": {
    "landing": {
      "subtitle": "Altijd klaar voor een avontuur!"
    },
    "about": {
      "title": "Over mij",
      "paragraph1": "Ik ben een gemotiveerde student, die geïnteresseerd in IT en alles dat te maken heeft met programmeren. Dit was de reden dat ik toegepaste informatica studeerde aan de Thomas More hogeschool in Geel (België) & JAMK (Finland). Een programma schrijven gebaseerd op de vragen van een vriend, ouder of klant, is mijn favoriete bezigheid.",
      "paragraph2": "Met een 2de bachelor, hoop ik mijn communicatie, team-skill en algemene kennis te verbeteren. Natuurlijk is programmeren niet het enige wat ik doe. Judo zal altijd mijn favoriet zijn, maar even duiken in een zwembad is ook niet slecht!",
      "paragraph3": "Mijn persoonlijkheid is plezier hebben en nieuwe mensen te ontmoeten and afwerken wat ik startte. Ik probeer geëngageerd te zijn binnen en buiten school activiteiten, bv. bloed doneren en nieuwe studenten begeleiden als tutor of deel uitmaken van de studentenvereniging."
    },
    "projects": {
      "name": "Mijn Projecten",
      "result": "Bezoek project",
      "result2": "of kijk hier",
      "progress": "Momenteel in development"
    },
    "skills": {
      "skillTitle": "Vaardigheden",
      "languageTitle": "Talen",
      "languages": {
        "dutch": "Nederlands (Moedertaal)",
        "english": "Engels (Goed)",
        "french": "Frans (Basis)",
        "finnish": "Fins (Lerend)"
      },
      "cv": {
        "english": "Engels",
        "dutch": "Nederlands"
      }
    },
    "footer": {
      "nameLabel": "Vul hier je naam in",
      "emailLabel": "Vul hier je email in",
      "messageLabel": "Schrijf hier je bericht",
      "namePlaceholder": "Naam",
      "emailPlaceholder": "Email",
      "messagePlaceholder": "Bericht",
      "nameErrorReq": "Vul een naam in.",
      "emailErrorReq": "Vul een email in.",
      "emailErrorPattern": "Deze email is niet correct.",
      "emailErrorEmail": "Deze email is niet correct.",
      "msgErrorReq": "Schrijf je bericht hier.",
      "sendButton": "Verstuur",
      "sendEmail": "Email verzonden!",
      "sendErrorEmail": "Kan email niet verzenden!"


    }
  },
  "projects": {
    "geo": {
      "completed": true,
      "img": "geo",
      "name": "Geolocatie",
      "paragraph1": "Dit project heb ik gemaakt in mijn vrije tijd. Mijn vader werkt samen met het archief van Geel (België) en wou graag een applicatie waarbij data uit 1834 op een hedendaagse kaart wordt getoond. Op lange termijn wordt dit project nog uitgebreid zodat er 6 kaarten zijn te zien.",
      "paragraph2": "Door aan dit project te werken, leerde ik hoe je een kaart refereert met een hedendaagse kaart. Alles werd gemaakt in QGIS dat veel aan te bieden heeft op basis van dataverwerking, zoals: het refereren, vershillende lagen tekenen, data selecteren en een mogelijkheid om te exporteren.",
      "link":"assets/Map_data/index.html"
    },
    "lm": {
      "completed": true,
      "img": "lm",
      "name": "LM-Sounds",
      "paragraph1": "LM-Sounds is een website gemaakt voor een vriend. We begonnen te praten over websites en hoe hij er altijd al één wou. Omdat ik graag mensen help, en met mijn achtergrond in IT, was ik geïnteresseerd. Met een aantal directe vragen kon ik al snel een MoSCoW opstellen.",
      "paragraph2": "Ik heb heel erg van het programmeren genoten, maar ook erg van het helpen van anderen. Ik probeer hem ook te ondersteunen en de website up-to-date te houden en er zeker van te zijn dat de hosting altijd online is.",
      "link": "https://lm-sounds.be/"
    },
    "br": {
      "completed": true,
      "img": "br",
      "name": "Beverage Rater",
      "paragraph1": "Tijdens dit project leerde ik werken met Figma, en het prioritizeren van de applicatie. Dankzij Figma was het veel handiger om een kleurenpalette te kiezen en het idee om te zetten in een werkende applicatie.",
      "paragraph2": "Dankzij de voorbereiding leerde ik vele nieuwe technologieën te gebruiken en te implementeren zodat een bezoeker makkelijker kon navigeren, en kon ik me aan het tijdschema houden.",
      "link": "https://beverage-rat.firebaseapp.com/"
    },
    "f1": {
      "completed": true,
      "img": "f1",
      "name": "F1-Stats",
      "paragraph1": "Het project startte toen ik een API vond op het internet, maar te lang duurde tegen het geüpdatet werd. Hierdoor kwam ik op het idee om zelf een API te maken. Ik begon eerst met mijn database te tekenen, zo wist ik wat ik kon opslagen. Vervolgens kon ik de back-end coderen en later ook de front-end.",
      "paragraph2": "Tijdens dit project heb ik vele nieuwe manieren van coderen ontdekt en nieuwe technieken leren gebruiken, die ik verworven heb op mijn stage. Als hosting ben nieuwe route ingeslagen: Amazon Web Services. Dit was de eerste keer dat ik dit gebruikte, dus het was moeilijk om alles juist uit te zoeken.",
      "link": "https://github.com/Michiel-VE/F1",
      "link2": "https://github.com/Michiel-VE/F1_API"
    }
  },
  "donate": {
    "title": "Waarom niet doneren?",
    "link": "https://www.rodekruis.be/wat-kan-jij-doen/geef-bloed-of-plasma/"
  }
}
